diagramas/fibonacci_diagrama.md
```mermaid
stateDiagram-v2
    [*] --> q0
    qaccept --> [*]
    q0 --> qParE: 1/1,R
    q0 --> qaccept: β/β,S
    qParE --> qParO: 1/1,R
    qParE --> qRewE: β/β,L
    qParO --> qParE: 1/1,R
    qParO --> qRewO: β/β,L
    qRewE --> qRewE: 1/1,L
    qRewE --> qFibIni: β/β,R
    qRewO --> qRewO: 1/1,L
    qRewO --> qFibIni: β/β,R
    qFibIni --> qMuro: 1/x,L
    qMuro --> qScan: β/#,R
    qScan --> qScan: x/x,R\n1/1,R
    qScan --> qEsc0: β/.,R
    qEsc0 --> qEsc1: β/;,R
    qEsc1 --> qCerr: β/1,R
    qCerr --> qRet: β/;,L
    qRet --> qRet: ;/;,L\n... (+3)
    qRet --> qLoop: #/#,S
    qLoop --> qChkC: #/#,R
    qChkC --> qIrFin: 1/x,R
    qChkC --> qaccept: ./.,R
    qChkC --> qChkC: x/x,R
    qIrFin --> qIrFin: 1/1,R\n./.,R\n;/;,R
    qIrFin --> qBuscar: β/β,L
    qBuscar --> qCop1: ;/;,L
    qCop1 --> qDep1: 1/y,R
    qCop1 --> qCop2: ;/;,L\n./.,L
    qDep1 --> qDep1: 1/1,R\n... (+3)
    qDep1 --> qRet1: β/1,L
    qRet1 --> qRet1: 1/1,L\n;/;,L
    qRet1 --> qCop1: y/1,L
    qCop2 --> qDep2: 1/z,R
    qCop2 --> qFinC: ;/;,R\n./.,R
    qDep2 --> qDep2: 1/1,R\n... (+4)
    qDep2 --> qRet2: β/1,L
    qRet2 --> qRet2: 1/1,L\n;/;,L
    qRet2 --> qCop2: z/1,L
    qFinC --> qFinC: 1/1,R\n;/;,R
    qFinC --> qRet: β/;,L
```
